src/cf/InformationRegisters/ЛицензииПоставщиковАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛицензииПоставщиковАлкогольнойПродукции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодВидаПродукции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛицензийНаПродажуАлкоголя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СведенияОбАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбАлкогольнойПродукции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛицензийНаПродажуАлкоголя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффПересчетаДал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВида129</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеВида129</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВида169</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеВида169</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыЛицензийНаПродажуАлкоголя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыЛицензийНаПродажуАлкоголя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпиртосодержащаяПищеваяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпиртосодержащаяНеПищеваяПродукция</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ЛицензииПоставщиковАлкогольнойПродукции/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВыбораВидаПродукции = Элементы.КодВидаПродукции.СписокВыбора;
	РегистрыСведений.СведенияОбАлкогольнойПродукции.СписокВидовПродукции(СписокВыбораВидаПродукции);
	СписокВыбораВидаПродукции[0].Представление = НСтр("ru = 'Все'");
	Если ПустаяСтрока(Запись.КодВидаПродукции) Тогда
		
		НаименованиеВидаПродукции = НСтр("ru = 'Ограничение не установлено'");
		
	Иначе
		
		ЭлементСписка = СписокВыбораВидаПродукции.НайтиПоЗначению(Запись.КодВидаПродукции);
		Если ЭлементСписка <> Неопределено Тогда
			НаименованиеВидаПродукции = СтрЗаменить(ЭлементСписка.Представление, Запись.КодВидаПродукции + " - ", "");
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДеятельностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЭталонныйВариант = Элемент.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение);
	Если ЭталонныйВариант <> Неопределено Тогда

		Запись.ВидДеятельности = ЭталонныйВариант.Представление;
		
		Если СтрНайти(ВРег(Запись.ВидДеятельности), "ПРОИЗВОДСТВО") = 0 Тогда
			// Указание кода вида продукции скорее всего не обязательно.
			ОчисткаВидаПродукции();

		КонецЕсли;

		Если Не ЗначениеЗаполнено(Запись.ВидЛицензии) Тогда
			Запись.ВидЛицензии = ВидЛицензииПоКодуПродукции(Запись.КодВидаПродукции);
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодВидаПродукцииПриИзменении(Элемент)
	
	Если ПустаяСтрока(Запись.КодВидаПродукции) Тогда
		ОчисткаВидаПродукции();
		Возврат;
	КонецЕсли;

	ЭлементСписка = Элемент.СписокВыбора.НайтиПоЗначению(Запись.КодВидаПродукции);
	Если ЭлементСписка <> Неопределено Тогда
		
		НаименованиеВидаПродукции = СтрЗаменить(ЭлементСписка.Представление, Запись.КодВидаПродукции + " - ", "");
		Запись.ВидЛицензии = ВидЛицензииПоКодуПродукции(Запись.КодВидаПродукции);
		
	Иначе
		
		НаименованиеВидаПродукции = НСтр("ru = 'Ограничение не установлено'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодВидаПродукцииОчистка(Элемент, СтандартнаяОбработка)
	
	ОчисткаВидаПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаВидаПродукции()
	
	Запись.КодВидаПродукции = Элементы.КодВидаПродукции.СписокВыбора[0].Значение;
	НаименованиеВидаПродукции = НСтр("ru = 'Ограничение не установлено'");
	
	Если Не ЗначениеЗаполнено(Запись.ВидЛицензии) Тогда
		Запись.ВидЛицензии = ВидЛицензииПоКодуПродукции(Запись.КодВидаПродукции);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПроизвольныйПериод(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период.ДатаНачала    = Запись.Период;
	Диалог.Период.ДатаОкончания = Запись.ДатаОкончания;
	
	ДополнительныеПараметры = Новый Структура("Диалог", Диалог);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПроизвольныйПериодЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьПроизвольныйПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Диалог = ДополнительныеПараметры.Диалог;
	Запись.Период = Диалог.Период.ДатаНачала;
	Запись.ДатаОкончания  = Диалог.Период.ДатаОкончания;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидЛицензииПоКодуПродукции(Знач КодВидаПродукции)

	ВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.АлкогольнаяПродукция;
	
	Если ПустаяСтрока(КодВидаПродукции) Тогда
		Возврат ВидЛицензии;
	КонецЕсли;
	
	КодыПива = РегламентированнаяОтчетностьАЛКО.МассивКодовИзМакетаСписки(
		"ВидыПродукции", ТекущаяДатаСеанса(), "Отчет.РегламентированныйОтчетАлкоПриложение26.Форма.ФормаОтчета");
	Если КодыПива.Найти(КодВидаПродукции) <> Неопределено Тогда
		ВидЛицензии = Перечисления.ВидыЛицензийНаПродажуАлкоголя.Пиво;
	КонецЕсли;
	
	Возврат ВидЛицензии;
	
КонецФункции

#КонецОбласти
